diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокументаДоп/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивСПараметрамиОткрытияФорммы = ПолучитьИзВременногоХранилища(Параметры.АдресДанных);
	Период.ДатаНачала = НачалоГода(МассивСПараметрамиОткрытияФорммы[0]);
	Период.ДатаОкончания = КонецГода(МассивСПараметрамиОткрытияФорммы[0]);
		
	Объект.ОтпускаСотрудников.Загрузить(МассивСПараметрамиОткрытияФорммы[1]);

	ОбновитьНаСервере();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьНаСервере()
	
	ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
	ГрафикОтпусков.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
	ГрафикОтпусков.Очистить();
	
	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	Для Каждого СтрокаГрафика Из Объект.ОтпускаСотрудников Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(СтрокаГрафика.Сотрудник);
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаГрафика.ДатаНачала;
		Интервал.Конец = СтрокаГрафика.ДатаОкончания;
		
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти
